'use strict'

//  1. Постфиксная и префиксная формы
{
let a = 1
let b = 1

let c = ++a 
let d = b++ 
// console.log(a, b, c, d) // 2, 2, 2, 1
}

//  2. Результат присваивания
{
    let a = 2
    let x = 1 + (a *= 2)
    // console.log(x) //5
}

//  3. Преобразование типов
{
    let a = "" - 1 + 0,     // -1
        b = true + false,   // 1
        c = 6 / "3",        // 2
        d = "2" * "3",      // 6
        e = 4 + 5 + "px",   // '9px'
        f = "$" + 4 + 5,    // '$45'
        g = "4" - 2,        // 2
        h = "4px" - 2,      // NaN
        i = "  -9  " + 5,   // ' -9 5'
        m = "  -9  " - 5,   // -14
        n = null + 1,       // 1
        p = undefined + 1,  // NaN
        r = " \t \n" - 2    // -2
    
    // console.log(a, b, c, d, e, f, g, h, i, m, n, p, r)
}

//  4. Исправьте сложение
{
    // let a = +prompt('Первое число?', 1)
    // let b = +prompt('Второе число?', 2)
    
    // alert(`Сумма чисел: ${a + b}`) // 3
}